{
  "security": [
    {
      "id": 1,
      "term": "セキュリティバイデザイン",
      "description": "情報システムやソフトウェアの開発において、最初からセキュリティを考慮に入れるアプローチ"
    },
    {
      "id": 2,
      "term": "プライバシーバイデザイン",
      "description": "情報システムやサービスの設計段階から個人情報の保護を組み込む考え方である"
    },
    {
      "id": 3,
      "term": "マクロウィルス",
      "description": "主にデータファイルの自動処理機能である「マクロ」を悪用して感染するウィルスである。このウィルスは、文書作成ソフトやスプレッドシートソフトに多くみられるもので特定の操作が行われた際に自動的に続行される設定がなされている。"
    },
    {
      "id": 4,
      "term": "RAT",
      "description": "リモートでコンピュータにアクセスするための悪意のあるソフトウェア。"
    },
    {
      "id": 5,
      "term": "ステルス技術",
      "description": "検知されにくくするための技術である。ポリモーフィック型やメタモーフィック型などの形式があり、これらはマルウェアが自らのコードを変化させることで、アンチウィルスソフトウェアや検知システムから隠れることができる"
    },
    {
      "id": 6,
      "term": "割れ窓理論",
      "description": "社会環境における小さな問題や放置が、より大きな犯罪や問題を引き起こす可能性があるという考え方である。"
    },
    {
      "id": 7,
      "term": "ボットハーダー",
      "description": "複数の感染したコンピュータやデバイスを遠隔で操る攻撃者のこと。ボットを持つ者"
    },
    {
      "id": 8,
      "term": "脅威モデリング",
      "description": "システムに対する潜在的な脅威を特定し、評価するプロセスである。これには攻撃者の種類やその攻撃の動機を分析することが含まれる"
    },
    {
      "id": 9,
      "term": "MITB攻撃",
      "description": "ユーザのブラウザ内で行われる攻撃手法の一つである。この攻撃は、マルウェアによってブラウザが乗っ取られ、ユーザの操作に基づいて悪意のある行動が実行されることを特徴とする。"
    },
    {
      "id": 10,
      "term": "IPスプーフィング",
      "description": "ネットワーク上で送信元のIPアドレスを偽装する攻撃手法の一つ。"
    },
    {
      "id": 11,
      "term": "リプレイ攻撃",
      "description": "ネットワーク上で盗まれたデータを利用して不正に通信を再送信する攻撃手法である"
    },
    {
      "id": 12,
      "term": "リフレクション攻撃",
      "description": "攻撃者が標的のサーバにリクエストを送り、そのリクエストを利用してサーバからターゲットに向けて応答を返させる手法である"
    },
    {
      "id": 13,
      "term": "クリプトじゃっキング",
      "description": "他人のコンピュータやネットワークのリソースを無断で利用して暗号通貨を採掘する攻撃手法である"
    },
    {
      "id": 14,
      "term": "やり取り型攻撃",
      "description": "攻撃者が被害者とリアルタイムでやり取りを行いながら情報を盗んだりシステムに侵入する攻撃手法である。フィッシングなどでユーザを誘導し、ID、PWを取得するなど"
    },
    {
      "id": 15,
      "term": "テンペスト攻撃",
      "description": "コンピュータや電子機器が発する電磁波を悪用して情報を盗み取る攻撃手法。"
    },
    {
      "id": 16,
      "term": "プロープ攻撃",
      "description": "ネットワークやシステムの脆弱性を探るために行われる攻撃手法。特定の情報を収集し、セキュリティの甘い個所を特定することを目的としている。"
    },
    {
      "id": 17,
      "term": "タイミング攻撃",
      "description": "暗号システムや認証プロトコルに対する攻撃手法の一つ。この攻撃は特定の操作や処理にかかる時間の違いを利用して、機密情報を抜き取ることを目的とする。"
    },
    {
      "id": 18,
      "term": "電力解析攻撃",
      "description": "暗号化されたデータを解読するためにデバイスの消費電力を分析する攻撃手法であるマイクロプロセッサやスマートカードなどの組込みシステムで用いられる。"
    },
    {
      "id": 19,
      "term": "オープンリゾルバの悪用",
      "description": "オープンリゾルバとはDNSサーバの一種で、だれでも自由に利用できるものを指す。これを利用することで、攻撃者は大量のリクエストを送信し、ほかサーバやサービスに対してDDoS攻撃を行うことができる"
    },
    {
      "id": 20,
      "term": "バージョンロールバック攻撃",
      "description": "ソフトウェアやシステムバージョンを意図的に古いものに戻す手法である。"
    },
    {
      "id": 21,
      "term": "敵対的サンプル",
      "description": "機械学習や人工知能のシステムを攻撃するために意図的に設計された入力データのこと。モデルが誤った判断をするように導くもの。"
    },
    {
      "id": 22,
      "term": "プロンプトインジェクション攻撃",
      "description": "主に人工知能や対話型システムに対して、悪意のある入力を行うことで不正な操作を引き起こそうとする攻撃手法である。システムが誤った応答を生成するように仕向ける"
    },
    {
      "id": 23,
      "term": "フットプリンティング",
      "description": "情報セキュリティ分野において、対象となるシステムやネットワークの情報を収集する手法である。このプロセスは攻撃者が特定の組織やサイトについての詳細な知識を得るための第一歩として重要であり、多くの場合攻撃の計画を立てる場合に使用される。"
    },
    {
      "id": 24,
      "term": "RaaS",
      "description": "ランサムウェア・アズ・サービスの略で、悪意のあるソフトウェアであるランサムウェアを他社が利用できる形で提供するサービスである。"
    },
    {
      "id": 25,
      "term": "ラテラルムーブメント",
      "description": "攻撃者が最初に侵入したシステムからほかのシステムへと移動し、ネットワーク内での権限を拡大する過程を指す。"
    },
    {
      "id": 26,
      "term": "CRYPTREC",
      "description": "暗号リスト日本における暗号技術の利用促進と安全性向上を目的とした、推奨される暗号アルゴリズムの一覧である。"
    },
    {
      "id": 27,
      "term": "RSA暗号",
      "description": "公開鍵暗号の代表的な方式"
    },
    {
      "id": 28,
      "term": "楕円曲線暗号",
      "description": "デジタル署名や秘密鍵の生成に使用される。必要な鍵の長さがほかの暗号技術に比べて短くて済む。"
    },
    {
      "id": 29,
      "term": "DH鍵共有方式",
      "description": "通信相手が秘密の情報を安全に共有するための暗号方式。双方が公開された数値をもとに自分の秘密の数値を用いて新たな計算をし、最終的に同じ値を持つことで暗号鍵を共有することができる。"
    },
    {
      "id": 30,
      "term": "秘密計算",
      "description": "データを秘匿しながら計算を行う技術である。この技術により、複数の参加者が互いに自分のデータを隠したまま、協力して計算を行うことができる。"
    },
    {
      "id": 31,
      "term": "第二原像発見困難性",
      "description": "暗号額において与えられたデータに対して同じハッシュ値を持つ別のデータを見つけることが非常に困難であること"
    },
    {
      "id": 32,
      "term": "衝突発見困難性",
      "description": "暗号技術において、異なる入力が同じ出力を持つことを発見することが非常に難しい性質"
    },
    {
      "id": 33,
      "term": "ブロック暗号",
      "description": "データを一定の長さのブロック単位で暗号化する技術である。具体的には平文を固定のビット数の塊に分け、それぞれの魂を特定のアルゴリズムを用いて暗号する"
    },
    {
      "id": 34,
      "term": "CBC",
      "description": "暗号技術におけるブロック暗号モードの一つ。データを固定サイズのブロックに分割し、それぞれを暗号化する際に前のブロックの暗号化効果を利用する仕組みを持つ"
    },
    {
      "id": 35,
      "term": "CTR",
      "description": "データを暗号化する際に使用されるモードの一つ。このモードは平文を小さなブロックに分け、それぞれのブロックを独立して暗号化するため高い並列処理能力を持つのが特徴である"
    },
    {
      "id": 36,
      "term": "ストリーム暗号",
      "description": "データをビット単位で暗号化する方式である。リアルタイムでのデータ処理が可能であるため、音声や映像などのストリーミングデータに適している"
    },
    {
      "id": 37,
      "term": "乱数生成",
      "description": "予測できない値を生成するプロセスである。特に暗号技術においては、安全な通信やデータ保護のために重要な役割を果たす。"
    },
    {
      "id": 38,
      "term": "鍵管理",
      "description": "機密情報を保護するために使用される鍵を生成、配布、保管、使用、破棄する一連のプロセスである。"
    },
    {
      "id": 39,
      "term": "危殆化",
      "description": "情報やデータが外部に漏洩したり、不正にアクセスされたりすることで、そのセキュリティが損なわれる状態を指す。特に暗号技術の文脈では、暗号化されたデータが解読されるリスクを含む。"
    },
    {
      "id": 40,
      "term": "ゼロ知識証明",
      "description": "ある情報を持っていることを証明する方法であるが、その情報自体を明かさずに証明できる技術である。"
    },
    {
      "id": 41,
      "term": "ブロックチェーン",
      "description": "情報を安全に記録・管理するための技術である。これはデータを「ブロック」という単位でまとめ、そのブロック同士を鎖のようにつなげていく仕組みを持つ。各ブロックにはその前のブロックとの関連情報が含まれているため、改ざんが非常に難しい。"
    },
    {
      "id": 42,
      "term": "XMLデジタル署名",
      "description": "XMLデータの整合性と認証を確保するための技術である。この技術は特定のXML文書に対して署名を行うことで、その内容が改ざんされていないことや正当な送信者によって発信されたことを証明する手段を提供する。"
    },
    {
      "id": 43,
      "term": "メッセージダイジェスト",
      "description": "データの内容を要約し、一位の短いハッシュ値に変換する技術である。"
    },
    {
      "id": 44,
      "term": "メッセージ認証",
      "description": "デジタル通信においてメッセージの内容が改ざんされていないことを確認するための技術である。"
    },
    {
      "id": 45,
      "term": "MAC (Message Authentication Code)",
      "description": "データの整合性と認証を確保するために使用される技術である。具体的には送信者が特定のメッセージに対して生成した短いコードで、受信者はそのコードを使ってメッセージが改ざんされていないかを確認することができる"
    },
    {
      "id": 46,
      "term": "HMAC",
      "description": "メッセージ認証に使用される手法で、送信者がメッセージに特定のハッシュ関数と秘密鍵を組み合わせて生成したコードである。この手法はデータ改ざんされていないことを確認するために利用され、メッセージの整合性と認証を同時に保証する役割を果たす。"
    },
    {
      "id": 47,
      "term": "チャレンジレスポンス認証",
      "description": "ユーザの身元を確認するための認証方式である。サーバがクライアントに対して「チャレンジ」と呼ばれるランダムなデータを送信する。クライアントはそのデータをもとに「レスポンス」を生成し、サーバに返す。これによりパスワードを送信しないで認証を行うことが可能である。"
    },
    {
      "id": 48,
      "term": "リスクベース認証",
      "description": "ユーザのログイン試行に対し、リスクの高い行動を識別して認証の厳格さを調整する技術である。この認証方式では、ユーザのアクセス状況や行動履歴、デバイスの安定性などを考慮し、不審な点があれば追加認証手続きを要求する"
    },
    {
      "id": 49,
      "term": "コードサイニング",
      "description": "ソフトウェアやアプリケーションが信頼できる作成者から提供されたことを証明するための技術である。このプロセスでは開発者が自身のコードにデジタル署名を行い、その署名が有効であるかを保証する。"
    },
    {
      "id": 50,
      "term": "Kerberos方式",
      "description": "コンピュータネットワークにおける利用者の認証を行うためのプロトコルである。この方式は、利用者が安全にリソースにアクセスするための認証を管理し、第三者が通信の内容を盗聴したり、利用者に成りすましたりすることを防ぐことを目的とする"
    },
    {
      "id": 51,
      "term": "FIDO UAF",
      "description": "ユーザがパスワードなしで安全に認証できる仕組みを提供するフレームワーク。生体を利用してユーザを認証するフレームワーク"
    },
    {
      "id": 52,
      "term": "FIDO U2F",
      "description": "オンラインサービスへのログイン時に利用される2要素認証の標準技術である。ハードウェアトークンやUSBデバイスを使用しセキュリティを強化する。パスワードを入力した後デバイスを接続して認証する必要がある"
    },
    {
      "id": 53,
      "term": "FIDO",
      "description": "安全な利用者認証を実現するためのオープンな標準技術である。デバイスや生体認証を利用してユーザを認証する仕組みを提供する。"
    },
    {
      "id": 54,
      "term": "EMV 3-Dセキュア",
      "description": "オンライン決済における利用者認証のためのセキュリティ技術の一つ。クレジットカードやデビットカードなどのトランザクションを保護する目的で開発された。従来の3-Dセキュアよりもさらに進化しており、ユーザの認証プロセスを簡素化するために、機械学習を用いたリスク評価を行うことができる"
    },
    {
      "id": 55,
      "term": "OpenID Connect",
      "description": "インターネット上での認証プロトコルの一つである。異なるWEBサイトやアプリケーションにおいて、ユーザが同じアカウントを使ってログインできるようになる"
    },
    {
      "id": 56,
      "term": "SAML",
      "description": "利用者の認証や認可に関する情報を交換するための標準的な規格。異なるシステム間でユーザ情報を安全にやり取りすることが可能になる。Single Sign Onに特に有効"
    },
    {
      "id": 57,
      "term": "IdP (Identity Provider)",
      "description": "利用者の身元を確認するサービスである。ユーザがオンラインサービスやアプリケーションにアクセスする際に、そのユーザが誰であるかを認証する役割を果たす"
    },
    {
      "id": 58,
      "term": "IDaaS",
      "description": "クラウドベースで提供されるアイデンティティ管理サービスである。ユーザの認証やアクセス管理を行い、様々なアプリケーションやシステムへの安全なアクセスを確保する役割を担っている。"
    },
    {
      "id": 59,
      "term": "セキュリティトークン",
      "description": "特定のユーザに対するアクセス権を示し、安全な通信やデータ保護を実現するために重要な役割を果たしている"
    },
    {
      "id": 60,
      "term": "PKI (Public Key Infrastructure)",
      "description": "デジタル通信における安全性を確保するための仕組み。具体的には公開鍵と秘密鍵を用いて情報の暗号化やデジタル署名を行うための技術とその関連サポートを指す。"
    },
    {
      "id": 61,
      "term": "デジタル証明書",
      "description": "特定の公開鍵とその持ち主の情報を結び付け、正当性を保証する役割。"
    },
    {
      "id": 62,
      "term": "ルート証明書",
      "description": "公開鍵基盤（PKI）において、信頼の最上位に位置する証明書である。この証明書は他の証明書に対して「信頼できる」と証明する役割を果たし、通常は認証局（CA）によって発行される。"
    },
    {
      "id": 63,
      "term": "トラストアンカー",
      "description": "公開鍵基盤において信頼の基点となる要素である。デジタル証明書の信頼性を判断するために使用される公開鍵のことを指す。信頼できる認証機関（CA）によって発行され、多くのシステムやアプリケーションがその情報をもとに安全な通信を行う"
    },
    {
      "id": 64,
      "term": "中間CA証明書",
      "description": "公開鍵基盤における証明書の一種である。この証明書は信頼されたルートCA（認証局）から発行され、さらに下位エンドエンティティ証明書を発行する役割をもつ。中間CA証明書を用いることで、公開鍵の発行と管理が階層的に行われる"
    },
    {
      "id": 65,
      "term": "サーバ証明書",
      "description": "サーバの正当性を証明するためのデジタル証明書。主にインターネット上での通信において、ユーザがアクセスするWEBサイトが信頼できるものであることを確認する役割を持っている。"
    },
    {
      "id": 66,
      "term": "クライアント証明書",
      "description": "ユーザやデバイスの身元を確認するために使用されるデジタル証明書である。この証明書は、公開鍵基盤（PKI）を利用して発行され、通信相手が真正であることを保証する役割を果たす。"
    },
    {
      "id": 67,
      "term": "コードサイニング証明書",
      "description": "ソフトウェアやアプリケーションの開発者がそのプログラムが正当であることを証明するためのデジタル証明書である。"
    },
    {
      "id": 68,
      "term": "CRL (Certificate Revocation List)",
      "description": "無効になったデジタル証明書の一覧である。証明書失効リストともいう。デジタル証明書はインターネット上での通信を安全に保障するために使用するが、特定の理由でのその有効性が失われることがある。このリストは、証明書が不正利用されたり、発行者が信頼できなくなったりする場合に更新される"
    },
    {
      "id": 69,
      "term": "OCSP (Online Certificate Status Protocol)",
      "description": "デジタル証明書の有効性をリアルタイムで確認するためのプロトコルである。公開鍵基盤において、安全な通信やデータ交換を行うためには、使用する証明書が有効であることを確認することが必要である。"
    },
    {
      "id": 70,
      "term": "CA (Certificate Authority)",
      "description": "公開鍵基盤において、重要な役割を果たす認証機関である。デジタル証明書を発行し、ユーザやデバイスの身元を確認する機能を持つ。これにより完全に通信を行うための信頼性が確保される。"
    },
    {
      "id": 71,
      "term": "GPKI (Government Public Key Infrastructure)",
      "description": "政府が提供するデジタル証明書の発行と管理を行うシステムである。このシステムは、政府機関や関連組織が安全に電子的な取引や情報のやり取りを行うために必要なインフラを整備している。"
    },
    {
      "id": 72,
      "term": "BCA (Bridge CA)",
      "description": "公開鍵基盤（PKI）におけるブリッジ認証局のことである。この認証局は、異なる認証局同士を接続し、たがいに信頼関係を築く役割を果たす。具体的には各認証局が発行したデジタル署名を相互に認識し、信頼性を高めるためのメカニズムを提供する。"
    },
    {
      "id": 73,
      "term": "情報セキュリティポリシーに基づく情報の管理",
      "description": "組織が情報を安全に管理するための原則やルールを定めたものであり、情報の取り扱いに関するガイドラインを提供し、データの機密性、完全性、可用性を確保することを目的としています。"
    },
    {
      "id": 74,
      "term": "情報資産",
      "description": "組織が持つ情報やデータ、システム、知識など、価値を持つ資源のことであり、業務の運営や意思決定において重要な役割を果たします。"
    },
    {
      "id": 75,
      "term": "リスクマネジメント",
      "description": "潜在的なリスクを特定し、それに対処するための計画を立てるプロセスです。"
    },
    {
      "id": 76,
      "term": "監視",
      "description": "システムやネットワークの状態、動作、または使用状況を継続的に観察し、問題や異常を検知するプロセスを指します。"
    },
    {
      "id": 77,
      "term": "情報セキュリティ事象",
      "description": "情報の機密性、完全性、可用性が脅かされる事象のことであり、サイバー攻撃や内部不正アクセス、データ漏洩などが含まれます。"
    },
    {
      "id": 78,
      "term": "情報セキュリティインシデント",
      "description": "情報資産やシステムに対して発生した、セキュリティに関する問題や脅威のことです。"
    },
    {
      "id": 79,
      "term": "アカウント管理",
      "description": "システムやアプリケーションにアクセスするためのユーザーアカウントを適切に管理するプロセスであり、アカウントの作成、削除、権限の設定、パスワードの管理などが含まれます。"
    },
    {
      "id": 80,
      "term": "最小権限の原則",
      "description": "各利用者が持つアクセス権を自身の業務遂行に必要な情報のみに制限することで、情報漏洩や不正アクセスを防ぎます。"
    },
    {
      "id": 81,
      "term": "クラウドサービスの責任共有モデル",
      "description": "クラウドサービスの提供者とユーザーの間でセキュリティやデータ管理の責任を明確に分ける仕組みです。"
    },
    {
      "id": 82,
      "term": "外部委託やクラウドサービスの利用時における情報セキュリティ",
      "description": "外部のサービスを利用する際に、情報やデータを安全に管理するための対策を指します。"
    },
    {
      "id": 83,
      "term": "サイバーハイジーン",
      "description": "情報セキュリティを維持するための基本的な習慣や手法を指す概念であり、パスワードの管理やソフトウェアの定期的な更新などが含まれます。"
    },
    {
      "id": 84,
      "term": "情報資産台帳",
      "description": "組織が所有する情報資産を一覧化し、その重要性や管理状態を把握するための記録簿です。"
    },
    {
      "id": 85,
      "term": "財産損失",
      "description": "物理的な資産や財務的な資産が減少することを指し、機器の破損や盗難、経済的な損失が含まれます。"
    },
    {
      "id": 86,
      "term": "責任損失",
      "description": "他者に対して何らかの損害を与えた場合、その賠償金や訴訟費用、及びその結果としての収入の減少などが含まれる損失を指します。"
    },
    {
      "id": 87,
      "term": "純収益の喪失",
      "description": "製品の売上が減少したり、市場の需要が変動したりすることで、計画的な利益が得られなくなる状況を指します。"
    },
    {
      "id": 88,
      "term": "人的損失",
      "description": "従業員の死亡や病気、事故による離脱など、労働力の喪失を指します。"
    },
    {
      "id": 89,
      "term": "オペレーショナルリスク",
      "description": "内部のプロセス、従業員の行動、システムの故障、あるいは外部からの影響によって引き起こされる可能性のあるリスクです。"
    },
    {
      "id": 90,
      "term": "サプライチェーンリスク",
      "description": "原材料の調達から製品の販売までの一連の過程に関わるすべてのリスクを含みます。"
    },
    {
      "id": 91,
      "term": "外部サービス利用のリスク",
      "description": "他の企業やサービスから提供される機能やデータを自社のシステムで利用する際に生じる潜在的な危険性です。"
    },
    {
      "id": 92,
      "term": "SNSによる情報発信のリスク",
      "description": "不正確な情報の拡散やプライバシーの侵害が発生しやすいという危険性のことです。"
    },
    {
      "id": 93,
      "term": "地政学的リスク",
      "description": "国や地域の政治的な状況が経済やビジネスに及ぼす影響を指すものです。"
    },
    {
      "id": 94,
      "term": "ペリル",
      "description": "特定の危険要因や損失を引き起こす可能性を指し、物理的な損害や財務的な損失の原因となる状況や出来事を示します。"
    },
    {
      "id": 95,
      "term": "ハザード",
      "description": "事故や災害が発生する可能性がある事象や条件のことを指し、リスクの源となる要因や状況を指します。"
    },
    {
      "id": 96,
      "term": "モラルハザード",
      "description": "保険や契約の存在によって、当人が本来の行動基準を緩めたり、過度なリスクをとったりすることがある状況を指します。"
    },
    {
      "id": 97,
      "term": "年間予想損失額",
      "description": "特定のリスクが発生した場合に、1年間において予想される金銭的な損失の額です。"
    },
    {
      "id": 98,
      "term": "得点法",
      "description": "リスクの発生確率と影響度を数値で表し、それらの得点を組み合わせることで、リスクの総合評価を行う手法です。"
    },
    {
      "id": 99,
      "term": "コスト要因",
      "description": "プロジェクトやビジネス活動における費用の発生に影響を与える要素のことです。"
    },
    {
      "id": 100,
      "term": "情報セキュリティリスクアセスメント",
      "description": "組織が情報資産の保護に関する潜在的なリスクを特定し、評価するプロセスです。"
    },
    {
      "id": 101,
      "term": "リスク基準",
      "description": "特定のリスクが受け入れ可能かどうかを判断するための指針を提供する評価基準です。"
    },
    {
      "id": 102,
      "term": "リスクレベル",
      "description": "特定の脅威や脆弱性がもたらす潜在的な影響の度合いを評価するための指標です。"
    },
    {
      "id": 103,
      "term": "リスクマトリックス",
      "description": "リスクの発生確率と影響度を視覚的に示す枠組みであり、リスクを評価するための視覚的なツールです。"
    },
    {
      "id": 104,
      "term": "リスク所有者",
      "description": "特定のリスクに対して責任を持つ個人または組織のことを指します。"
    },
    {
      "id": 105,
      "term": "リスク源",
      "description": "悪意のある攻撃者、技術的な脆弱性、人的なミス、自然災害などが挙げられます。"
    },
    {
      "id": 106,
      "term": "リスクアセスメントのプロセス",
      "description": "情報セキュリティにおけるリスクを特定し、分析し、評価する一連の手順を指します。"
    },
    {
      "id": 107,
      "term": "リスク忌避",
      "description": "潜在的な危険が生じる状況を避けることで、組織や個人の安全を確保することが目的です。"
    },
    {
      "id": 108,
      "term": "リスク選好",
      "description": "個人や組織がリスクを受け入れる度合いを表す概念です。"
    },
    {
      "id": 109,
      "term": "リスクの定性的分析",
      "description": "事故や脅威が発生した際の影響や可能性を主観的な判断で評価することに重点を置く分析手法です。"
    },
    {
      "id": 110,
      "term": "リスクの定量的分析",
      "description": "リスクの発生確率や影響度を定量的に計算し、具体的な数値を用いてリスクを分析する手法です。"
    },
    {
      "id": 111,
      "term": "リスクコントロール",
      "description": "特定のリスクを評価し、そのリスクが引き起こす可能性や影響度を考慮した上で、リスクを軽減するための対策を講じることを指します。"
    },
    {
      "id": 112,
      "term": "リスクヘッジ",
      "description": "不測の事態やリスクに対して備えを行う手法であり、システムやデータに対する脅威を軽減するための戦略を指します。"
    },
    {
      "id": 113,
      "term": "リスクファイナンシング",
      "description": "リスクが実際に発生した場合の影響を軽減するために、資金を準備することが重視される手法です。"
    },
    {
      "id": 114,
      "term": "サイバー保険",
      "description": "企業がサイバー攻撃やデータ漏洩による損失を軽減するために設計された保険です。"
    },
    {
      "id": 115,
      "term": "リスク回避",
      "description": "潜在的な脅威や危険を評価し、それらを回避するために行動を変更することを指します。"
    },
    {
      "id": 116,
      "term": "リスク共有",
      "description": "保険を通じてリスクを移転することや、異なるプロジェクトに投資を分散させることでリスクを減少させます。"
    },
    {
      "id": 117,
      "term": "リスク保有",
      "description": "特定のリスクを受容して自社の資源でリスクの影響を負担する戦略を指します。"
    },
    {
      "id": 118,
      "term": "リスク集約",
      "description": "複数のリスクを一つの枠組みでまとめて評価または管理する手法です。"
    },
    {
      "id": 119,
      "term": "残留リスク",
      "description": "対策によって一定程度リスクは低減されるが、完全にゼロにはできないリスクのことです。"
    },
    {
      "id": 120,
      "term": "リスク対応計画",
      "description": "リスクが発生した場合の影響を最小限に抑えるための戦略や具体的な行動を定義するものです。"
    },
    {
      "id": 121,
      "term": "リスク登録簿",
      "description": "識別されたリスクを記録し、管理するための文書です。"
    },
    {
      "id": 122,
      "term": "リスクコミュニケーション",
      "description": "リスクに関する情報を関係者間で効果的に伝達するプロセスを指します。"
    },
    {
      "id": 123,
      "term": "緊急事態の区分",
      "description": "異常事態や脅威が発生した際に、その深刻度や影響を分析し、適切に対応するための分類方法です。"
    },
    {
      "id": 124,
      "term": "緊急時対応計画",
      "description": "予期せぬ事態や災害が発生した際に、組織が迅速に対応し、業務を継続するための計画を指します。"
    },
    {
      "id": 125,
      "term": "復旧計画",
      "description": "情報システムの障害や災害が発生した際に、業務を迅速に再開するための手順や方針を定めた文書です。"
    },
    {
      "id": 126,
      "term": "災害復旧",
      "description": "データのバックアップやシステムの冗長化を通じて、事業の継続性を確保するために重要です。"
    },
    {
      "id": 127,
      "term": "バックアップによる対策",
      "description": "重要な情報やシステムのコピーを定期的に作成することで、災害やエラーによる影響を最小限に抑えることができます。"
    },
    {
      "id": 128,
      "term": "被害状況の調査手法",
      "description": "サイバー攻撃やインシデントが発生した際に、その影響を評価し、どの程度の損害が生じたかを明らかにするための方法です。"
    },
    {
      "id": 129,
      "term": "情報セキュリティ方針",
      "description": "組織がどのように情報を管理し、保護するかに関する指針を提供し、情報セキュリティの目的や目標を明確にするために作成されます。"
    },
    {
      "id": 130,
      "term": "情報セキュリティ目的",
      "description": "情報が持つ機密性、完全性、可用性を確保するために必要な指針となります。"
    },
    {
      "id": 131,
      "term": "情報セキュリティ対策基準",
      "description": "アクセス制限、データ暗号化、定期的な監査などが含まれます。"
    },
    {
      "id": 132,
      "term": "情報管理規程",
      "description": "情報の収集、保管、利用、廃棄に関する具体的な方針が含まれ、情報セキュリティを確保するための指針となります。"
    },
    {
      "id": 133,
      "term": "秘密情報管理規程",
      "description": "どのような情報が秘密に該当するか、情報の取り扱い方法やアクセス権限について詳細に定めています。"
    },
    {
      "id": 134,
      "term": "文書管理規程",
      "description": "文書の作成、保存、変更、廃棄に関する方針が含まれ、情報セキュリティを確保するために重要な役割を果たすものです。"
    },
    {
      "id": 135,
      "term": "情報セキュリティインシデント対応規程",
      "description": "インシデントの検出、分析、対処、報告までの一連のプロセスを明確にし、迅速かつ効果的な対応を可能にします。"
    },
    {
      "id": 136,
      "term": "情報セキュリティ教育の規程",
      "description": "定期的なトレーニングや研修、評価基準の設定、教育内容の見直しなどが含まれます。"
    },
    {
      "id": 137,
      "term": "プライバシーポリシー",
      "description": "収集する情報の種類、利用目的、情報の第三者への提供、保管期間、利用者の権利などが含まれます。"
    },
    {
      "id": 138,
      "term": "職務規程",
      "description": "機密情報の取り扱いや、アクセス権の管理、情報システムの利用方法が含まれます。"
    },
    {
      "id": 139,
      "term": "罰則の規程",
      "description": "情報漏洩や不適切なシステム利用などの行為に対する罰則が規定されています。"
    },
    {
      "id": 140,
      "term": "対外説明の規程",
      "description": "機密情報や個人情報が不適切に公開されるのを防ぐために設けられており、情報公開の基準や手続きを明確に定めています。"
    },
    {
      "id": 141,
      "term": "例外の規程",
      "description": "特別な事情により通常のルールが適用できない場合に、この規程が用いられます。"
    },
    {
      "id": 142,
      "term": "規則更新の規程",
      "description": "定期的な見直しのスケジュールや、更新の手続き、改善点の評価方法等が含まれます。"
    },
    {
      "id": 143,
      "term": "規程の承認手続",
      "description": "策定された規程が各関係者によって確認され、承認を得る過程が含まれます。"
    },
    {
      "id": 144,
      "term": "ソーシャルメディアガイドライン",
      "description": "個人情報の取り扱いや、会社に関する情報の公開範囲、また是正すべき行動や禁止事項を明示します。"
    },
    {
      "id": 145,
      "term": "ISMS適用範囲",
      "description": "どの部門やプロセス、情報資産がISMSの管理対象となるかを明確にします。"
    },
    {
      "id": 146,
      "term": "リーダーシップ",
      "description": "組織のトップがセキュリティポリシーを積極的に推進することで、全員がその重要性を理解し、協力してセキュリティを強化することができます。"
    },
    {
      "id": 147,
      "term": "計画",
      "description": "セキュリティポリシーの策定、リスクの特定、対策の優先順位付けが含まれます。"
    },
    {
      "id": 148,
      "term": "運用",
      "description": "定期的なセキュリティチェックや社員への教育・訓練が運用の一環です。"
    },
    {
      "id": 149,
      "term": "パフォーマンス評価",
      "description": "内部監査やマネジメントレビューなどの手法を通じて実施されます。"
    },
    {
      "id": 150,
      "term": "改善",
      "description": "不適合が見つかれば、その原因を分析し、再発防止策を実施することが求められます。"
    },
    {
      "id": 151,
      "term": "管理目的",
      "description": "機密情報の保護や情報漏洩の防止、法令遵守を達成することが目指されます。"
    },
    {
      "id": 152,
      "term": "組織的管理策",
      "description": "情報資産に対するアクセス制御や、セキュリティ教育、インシデント対応手順などが含まれます。"
    },
    {
      "id": 153,
      "term": "人的管理策",
      "description": "社員への定期的な情報セキュリティ教育を行うことで、意識向上を図り、内部からの脅威を軽減することができます。"
    },
    {
      "id": 154,
      "term": "物理的管理策",
      "description": "監視カメラ、侵入防止装置、アクセス制御システムなどが含まれます。"
    },
    {
      "id": 155,
      "term": "技術的管理策",
      "description": "システムのアクセス制御、データの暗号化、不正侵入検知システムなどが含まれます。"
    },
    {
      "id": 156,
      "term": "管理策タイプ",
      "description": "予防、検知、是正の3つのカテゴリーがあります。"
    },
    {
      "id": 157,
      "term": "サイバーセキュリティ概念",
      "description": "識別、防御、検知、対応、復旧の5つの要素が含まれます。"
    },
    {
      "id": 158,
      "term": "有効性",
      "description": "セキュリティ対策が情報資産を保護するためにどれだけ適切に機能しているかを評価するために使われます。"
    },
    {
      "id": 159,
      "term": "ISMS適合性評価制度",
      "description": "ISO/IEC 27001という国際規格に基づいて評価が行われ、その結果、適合していると認められた組織はISMS認証を取得できます。"
    },
    {
      "id": 160,
      "term": "ISMS認証",
      "description": "組織が情報の機密性、完全性、可用性を確保するためのルールや手順を整備し、実際にそれを実行しているかどうかが審査されます。"
    },
    {
      "id": 161,
      "term": "JIS Q 27001",
      "description": "リスク評価やリスクマネジメントを行い、セキュリティ対策を実施するための手順が示されています。"
    },
    {
      "id": 162,
      "term": "JIS Q 27002",
      "description": "アクセス制御、情報の保護、脅威の監視など、実践的な例が挙げられ、組織が効果的にセキュリティを向上させるための支援を提供します。"
    },
    {
      "id": 163,
      "term": "情報セキュリティガバナンス",
      "description": "リスクの管理やコンプライアンスの遵守が容易になり、全体的な情報セキュリティの向上に寄与します。"
    },
    {
      "id": 164,
      "term": "JIS Q 27017",
      "description": "データの暗号化やアクセス管理の方針などが示されることで、企業がセキュリティの強化を図るための指針となります。"
    },
    {
      "id": 165,
      "term": "インシデントハンドリング",
      "description": "インシデントの検知と連絡受付から始まり、報告された問題の重要度を評価するトリアージを行います。"
    },
    {
      "id": 166,
      "term": "テイクダウン",
      "description": "フィッシングサイトやマルウェアを配布しているサーバを特定し、その運営者と連携してコンテンツを削除することが一般的です。"
    },
    {
      "id": 167,
      "term": "情報セキュリティ委員会",
      "description": "定期的なセキュリティ評価や、従業員に対するセキュリティ教育の実施が含まれます。"
    },
    {
      "id": 168,
      "term": "CSIRT",
      "description": "インシデントの検知、分析、対応策の実施、そして再発防止策の提案を行います。"
    },
    {
      "id": 169,
      "term": "PSIRT",
      "description": "特定のソフトウェアに深刻な脆弱性が発見されると、PSIRTはその情報をもとに、影響を受ける全てのユーザーに向けて警告を発し、修正パッチや利用方法を提供します。"
    },
    {
      "id": 170,
      "term": "SOC",
      "description": "企業のセキュリティイベントを監視し、異常が発生した際には自動的にアラートを生成し、適切な対策を講じることが求められます。"
    },
    {
      "id": 171,
      "term": "エシカルハッカー",
      "description": "サイバー攻撃を模倣してセキュリティの弱点を発見し、これを利用して実際の悪意ある攻撃から組織を守る手助けを行います。"
    },
    {
      "id": 172,
      "term": "サイバーセキュリティ戦略本部",
      "description": "脅威の分析やリスク評価を行い、必要な対策を講じます。"
    },
    {
      "id": 173,
      "term": "国家サイバー統括室",
      "description": "政府機関や民間企業との連携を図り、サイバーセキュリティの強化や情報共有を行う役割を持つ。"
    },
    {
      "id": 174,
      "term": "IPAセキュリティセンター",
      "description": "セキュリティインシデントに関する対応ガイドや、教育・啓発活動を通じて、企業や個人がネットワークやシステムを安全に運用できるよう支援しています。"
    },
    {
      "id": 175,
      "term": "JPCERTコーディネーションセンター",
      "description": "インターネット上の脅威に対する情報提供や、関連する機関との連携を図るなど、国内外のセキュリティの向上に寄与しています。"
    },
    {
      "id": 176,
      "term": "J-CSIP",
      "description": "攻撃手法やその対策、脆弱性情報などを共有することで、早期の発見や対処が可能となります。"
    },
    {
      "id": 177,
      "term": "サイバーレスキュー隊",
      "description": "事故後の復旧作業だけではなく、事前の教育や訓練を通じて、被害を未然に防ぐための施策にも注力しています。"
    },
    {
      "id": 178,
      "term": "JVN (Japan Vulnerability Notes)",
      "description": "新たに発見された脆弱性の詳細や対策方法を公表し、利用者が適切な対策を講じられるよう支援しています。"
    },
    {
      "id": 179,
      "term": "TrustedWeb推進協議会",
      "description": "Webサイトが安全に運営されるためのガイドラインやベストプラクティスを策定し、広く普及させることで、悪意ある攻撃からユーザーを守る役割を果たしています。"
    },
    {
      "id": 180,
      "term": "コンピュータ不正アクセス届出制度",
      "description": "企業や組織は不正アクセスを検知した場合、所定の手続きに従い、法に基づいて報告を行うことで、被害の拡大を防ぎ、情報の保護を図ることができます。"
    },
    {
      "id": 181,
      "term": "コンピュータウイルス届出制度",
      "description": "ウイルスの踏査や解析が行われ、被害の拡大を防ぐための対策が迅速に講じられることが可能となります。"
    },
    {
      "id": 182,
      "term": "ソフトウェア等の脆弱性関連情報に関する届出制度",
      "description": "発見された脆弱性を開発者や運営者が適切に対処できるようにするため、報告方法や手順を明確に定めている。"
    },
    {
      "id": 183,
      "term": "情報セキュリティサービス基準",
      "description": "データの保存や通信の際に適用される暗号化技術やアクセス制御のルールが含まれる。"
    },
    {
      "id": 184,
      "term": "情報セキュリティサービス審査登録制度",
      "description": "サービスの運営状況やリスク管理の体制が審査され、一定の基準を満たすことで公式に登録される。"
    },
    {
      "id": 185,
      "term": "情報セキュリティサービス基準適合サービスリスト",
      "description": "各サービスがどのようなセキュリティ基準を満しているかが示され、利用者が信頼できるサービスを選定するための参考となる。"
    },
    {
      "id": 186,
      "term": "ISMAP",
      "description": "システムの設計や運用に関する基準を設け、それに基づいて評価を行うことで、情報漏洩や不正アクセスといったリスクを低減することを目的としている。"
    },
    {
      "id": 187,
      "term": "情報セキュリティ早期警戒パートナーシップ",
      "description": "セキュリティインシデントの情報をリアルタイムで共有することで、各組織が迅速に対応できるようになる。"
    },
    {
      "id": 188,
      "term": "NOTICE",
      "description": "サイバー攻撃が疑われる場合、関連するリスクを周知するためにNOTICEが発出されることがある。"
    },
    {
      "id": 189,
      "term": "SECURITY ACTION",
      "description": "企業がセキュリティに関する行動計画を作成し、その実施状況を評価することが求められる。"
    },
    {
      "id": 190,
      "term": "ISAC (Information Sharing and Analysis Center)",
      "description": "サイバー攻撃の事例や防御手法を共有することにより、参加者全体のリスクを低減し、迅速な対応が可能となる。"
    },
    {
      "id": 191,
      "term": "コンピュータウイルス対策基準",
      "description": "定期的なウイルススキャンや、最新のウイルス定義ファイルの更新、セキュリティパッチの適用が含まれる。"
    },
    {
      "id": 192,
      "term": "コンピュータ不正アクセス対策基準",
      "description": "不正アクセスの検知、対応、調査の方法や、セキュリティ対策の実施に関連する手順が含まれている。"
    },
    {
      "id": 193,
      "term": "ソフトウェア製品等の脆弱性関連情報に関する取扱規程",
      "description": "情報の収集、分析、評価、公開のプロセスについて詳細に規定されており、関係者間での情報共有の促進を図ることが目的である。"
    },
    {
      "id": 194,
      "term": "政府機関等の情報セキュリティ対策のための統一基準群",
      "description": "アクセス管理やデータ暗号化、インシデント対応の手順などが含まれ、不正アクセスや情報の改ざんを防止するための指針を提供する。"
    },
    {
      "id": 195,
      "term": "サイバーセキュリティ経営ガイドライン",
      "description": "企業が自らの状況に応じてセキュリティ対策を強化するためのフレームワークを提供し、持続的な改善を促進する役割も果たしている。"
    },
    {
      "id": 196,
      "term": "中小企業の情報セキュリティ対策ガイドライン",
      "description": "パスワード管理やデータの暗号化、従業員の教育などが含まれ、安全なネットワーク環境を維持するための手法が提案されている。"
    },
    {
      "id": 197,
      "term": "IoTセキュリティガイドライン",
      "description": "強固なパスワードの使用、ソフトウェアの定期的な更新、デバイスのアクセス管理の徹底などが推奨されている。"
    },
    {
      "id": 198,
      "term": "サイバー・フィジカル・セキュリティ対策フレームワーク",
      "description": "セキュリティリスクの評価、脅威分析、対策導入のプロセスが含まれ、組織がサイバー攻撃や物理的侵入から資産を守るための指針となる。"
    },
    {
      "id": 199,
      "term": "金融機関等コンピュータシステムの安全対策基準・解説書",
      "description": "システムの脆弱性を特定して対策を講じることや、情報セキュリティ教育を従業員に実施することが推奨される。"
    },
    {
      "id": 200,
      "term": "PCI DSS",
      "description": "データの暗号化、アクセス管理、定期的なセキュリティテストなどが含まれ、これを遵守することで悪意のある攻撃から情報を守ることができる。"
    },
    {
      "id": 201,
      "term": "サイバーセキュリティフレームワーク",
      "description": "フレームワークは検出、対応、回復などの機能を含み、組織のニーズに応じた対策を実施することができる。"
    },
    {
      "id": 202,
      "term": "ISO/IEC15408",
      "description": "情報セキュリティのセキュリティ評価基準を定めたもの。「コモンクライテリア」とも呼ばれ、システムや製品のセキュリティ機能を客観的に評価するための枠組み"
    },
    {
      "id": 203,
      "term": "セキュリティ機能要件",
      "description": "情報の機密性、完全性、可用性を確保するために設計されている"
    },
    {
      "id": 204,
      "term": "セキュリティ保証要件",
      "description": "システムが安全であるかどうかを確認するために設計されており、リスクを管理し、攻撃者から守るために必要な対策を示している。"
    },
    {
      "id": 205,
      "term": "JCMVP",
      "description": "日本における暗号モジュールの試験及び認証制度である。暗号技術を使用する機器やソフトウェアが、公的な基準に従って適切に機能し、安全であることを確認するために設けられている。"
    },
    {
      "id": 206,
      "term": "CVSS (Common Vulnerability Scoring System)",
      "description": "ソフトウェアやシステムに存在する脆弱性を評価し、リスクの度合いを数値で示すための基準"
    },
    {
      "id": 207,
      "term": "CWE (Common Weakness Enumeration)",
      "description": "ソフトウェアの脆弱性を体系的に分類したリストである。"
    },
    {
      "id": 208,
      "term": "脆弱性報奨金制度",
      "description": "企業や団体が自社システムのセキュリティを向上させるために、外部のセキュリティ研究者やハッカーに対して脆弱性の発見を奨励するプログラムである。"
    },
    {
      "id": 209,
      "term": "CC (Common Criteria)",
      "description": "コモンクライテリアのこと。製品やシステムの安全性や信頼性を評価するための国際的なフレームワークであり、特にセキュリティ評価に焦点を当てている。"
    },
    {
      "id": 210,
      "term": "PP (Protection Profile)",
      "description": "情報技術のセキュリティ評価に関する基準の一部であるプロテクションプロファイルのこと。特定のシステムや製品が満たすべきセキュリティ要件を明文化した文書であり、ISO/IEC15408に基づいて作成される"
    },
    {
      "id": 211,
      "term": "CEM (Common Evaluation Methodology)",
      "description": "コンピュータシステムのセキュリティを評価するための体系的なアプローチを提供するものであり、ISO/IEC15408に基づいている。"
    },
    {
      "id": 212,
      "term": "EAL (Evaluation Assurance Level)",
      "description": "ISO/IEC15408製品がセキュリティの要求をどの程度満たしているかを示す指標であり、1～7までの段階評価され、高いレベルに達するほど製品が厳格なセキュリティ基準をクリアしていることを意味する"
    },
    {
      "id": 213,
      "term": "JISEC",
      "description": "情報技術のセキュリティを評価及び認証するための制度。ISO/IEC15408やISO/IEC18049に基づいており、情報システムの安全性を客観的に評価する。"
    },
    {
      "id": 214,
      "term": "組織における内部不正防止ガイドライン",
      "description": "組織内での不正行為を防ぐために策定された指針であり、職員による不正行為や不適切な行動を防ぐための具体的な施策や手続きが含まれています。"
    },
    {
      "id": 215,
      "term": "情報セキュリティ啓発",
      "description": "組織や個人が情報セキュリティに対する認識を高めるための活動です。"
    },
    {
      "id": 216,
      "term": "情報セキュリティ訓練",
      "description": "組織内の従業員に対して情報セキュリティに関する知識や対処法を教育するプロセスです。"
    },
    {
      "id": 217,
      "term": "認証情報の割当て及び管理",
      "description": "システムやネットワークにアクセスする際の本人確認のための情報を適切に配布し、管理するプロセスです。"
    },
    {
      "id": 218,
      "term": "UBA (User Behavior Analytics)",
      "description": "ユーザーの行動データを分析して、セキュリティリスクを特定し、対応するための手法です。"
    },
    {
      "id": 219,
      "term": "UEBA (User and Entity Behavior Analytics)",
      "description": "ユーザーやデジタルエンティティの行動を分析する手法であり、これにより、普段とは異なる行動を検知し、潜在的なセキュリティリスクを早期に発見することが可能となります。"
    },
    {
      "id": 220,
      "term": "セキュリティクリアランス",
      "description": "特定の情報や場所にアクセスするために必要な許可を示すものであり、主に政府機関や軍事関連の組織で使用されます。"
    },
    {
      "id": 221,
      "term": "秘密保持契約・誓約書",
      "description": "当事者間で特定の情報を第三者に漏らさないことを約束する法的な契約です。"
    },
    {
      "id": 222,
      "term": "クラッキング対策",
      "description": "不正アクセスやデータ盗取を防ぐために行うセキュリティ対策の一つです。"
    },
    {
      "id": 223,
      "term": "不正アクセス対策",
      "description": "許可されていないユーザーがシステムやデータにアクセスすることを防ぐための手段や対策です。"
    },
    {
      "id": 224,
      "term": "情報漏えい対策",
      "description": "外部に漏れる可能性のある情報を守るために講じるすべての施策や対策を指します。"
    },
    {
      "id": 225,
      "term": "マルウェア対策",
      "description": "コンピュータやネットワークを不正なソフトウェアから守るための手段や方法です。"
    },
    {
      "id": 226,
      "term": "ランサムウェア対策",
      "description": "悪意のあるソフトウェアによってデータが暗号化されたり、システムがロックされたりした場合に、それを防止または対処するための方法やプロセスを指します。"
    },
    {
      "id": 227,
      "term": "3-2-1ルール",
      "description": "データのバックアップを効果的に管理するための原則であり、データを保護するために「3つのコピー」を「2つの異なるメディア」に保存し、さらに「1つはオフサイト」で管理することが重要とされます。"
    },
    {
      "id": 228,
      "term": "WORM (Write Once Read Many)",
      "description": "一度書き込んだデータを変更できず、何度でも読み取ることができるストレージの特性を指します。"
    },
    {
      "id": 229,
      "term": "イミュータブルバックアップ",
      "description": "データが変更されず、書き込みや削除ができない状態のバックアップです。"
    },
    {
      "id": 230,
      "term": "動的解析",
      "description": "ソフトウェアやシステムの動作を実際に実行しながら評価する手法です。"
    },
    {
      "id": 231,
      "term": "静的解析",
      "description": "ソフトウェアのソースコードや構成ファイルを実行することなく、文章や構文の誤り、不具合、セキュリティ上の脆弱性を検出する手法です。"
    },
    {
      "id": 232,
      "term": "秘匿化",
      "description": "データや情報の内容を第三者に理解されにくくする技術や手法です。"
    },
    {
      "id": 233,
      "term": "匿名化の手法",
      "description": "個人情報やデータを特定できない形に変換するための方法です。"
    },
    {
      "id": 234,
      "term": "アクセス制御",
      "description": "情報資源へのアクセスを制限し、許可されたユーザーのみが特定の情報やシステムにアクセスできるようにするセキュリティ対策です。"
    },
    {
      "id": 235,
      "term": "特権的アクセス権の管理",
      "description": "情報システムやネットワークにおいて、特別な権限を持つユーザーやプロセスのアクセスを制御する仕組みを指します。"
    },
    {
      "id": 236,
      "term": "ログ管理",
      "description": "システムやアプリケーションが生成するログデータを収集、保存、分析するプロセスを指します。"
    },
    {
      "id": 237,
      "term": "脆弱性管理",
      "description": "システムやソフトウェアに存在する脆弱性を特定、評価、修正するプロセスです。"
    },
    {
      "id": 238,
      "term": "SBOM (Software Bill of Materials)",
      "description": "ソフトウェアの構成要素や依存関係を詳細に記載したリストです。"
    },
    {
      "id": 239,
      "term": "ネットワーク監視",
      "description": "コンピュータネットワークの状態を常時チェックし、パフォーマンスやセキュリティの問題を早期に発見するための手法です。"
    },
    {
      "id": 240,
      "term": "アクセス権の設定",
      "description": "情報システムにおけるデータやリソースへのアクセスを制御するための仕組みです。"
    },
    {
      "id": 241,
      "term": "侵入検知",
      "description": "ネットワークやシステムに対する不正アクセスや攻撃を監視し、検出するための技術や手法です。"
    },
    {
      "id": 242,
      "term": "侵入防止",
      "description": "ネットワークやシステムへの不正アクセスを検知し、それを阻止するための技術や手法です。"
    },
    {
      "id": 243,
      "term": "DMZ (DeMilitarized Zone)",
      "description": "内部ネットワークと外部ネットワークの間に配置される中立的な領域です。"
    },
    {
      "id": 244,
      "term": "検疫ネットワーク",
      "description": "感染の疑いがあるデバイスやネットワークの一部を隔離するために使用されるセグメントです。"
    },
    {
      "id": 245,
      "term": "URLフィルタリング",
      "description": "Webサイトへのアクセスを制御するための技術です。"
    },
    {
      "id": 246,
      "term": "コンテンツフィルタリング",
      "description": "特定の情報やデータを自動的に選別し、表示またはアクセスを制御する技術のことです。"
    },
    {
      "id": 247,
      "term": "携帯端末のセキュリティ",
      "description": "携帯電話、スマートフォン、タブレット端末などのデバイスを守るための技術的な対策を指します。"
    },
    {
      "id": 248,
      "term": "セキュアエレメント",
      "description": "安全なデータ処理とストレージを提供するために設計された専用のハードウェアです。"
    },
    {
      "id": 249,
      "term": "TPM (Trusted Platform Module)",
      "description": "デバイスのセキュリティを強化するためのハードウェアに組み込まれたモジュールです。"
    },
    {
      "id": 250,
      "term": "セキュアブート",
      "description": "コンピュータの起動時に、信頼できるソフトウェアのみを実行することを保証するための機能です。"
    },
    {
      "id": 251,
      "term": "データマスキング",
      "description": "機密情報を保護するために、その内容を変換して見えなくする技術です。"
    },
    {
      "id": 252,
      "term": "暗号化消去",
      "description": "暗号化されたデータの復号鍵を消去することによって、データが再利用できなくなる技術です。"
    },
    {
      "id": 253,
      "term": "電子透かし",
      "description": "画像や音声、動画などのデジタルデータに目に見えない形で情報を埋め込む技術です。"
    },
    {
      "id": 254,
      "term": "脅威インテリジェンスの利用",
      "description": "セキュリティリスクを理解し、対策を講じるために、情報を収集・分析するプロセスです。"
    },
    {
      "id": 255,
      "term": "EDR (Endpoint Detection and Response)",
      "description": "エンドポイントにおけるサイバーセキュリティ対策の一つであり、端末内での不正アクセスやマルウェアの活動をリアルタイムで監視し、異常が発生した際には迅速に対応する仕組みを持っています。"
    },
    {
      "id": 256,
      "term": "DLP (Data Loss Prevention)",
      "description": "データ損失防止の取り組みを指し、機密情報や重要なデータが不正に外部に漏えいしないようにするための技術やポリシーを含みます。"
    },
    {
      "id": 257,
      "term": "SIEM (Security Information and Event Management)",
      "description": "セキュリティ情報およびイベント管理の略称であり、セキュリティイベントを収集・分析・管理するためのソリューションです。"
    },
    {
      "id": 258,
      "term": "ファイアウォール",
      "description": "ネットワークを外部の脅威から守るためのセキュリティ機器またはソフトウェアです。"
    },
    {
      "id": 259,
      "term": "WAF (Web Application Firewall)",
      "description": "Webアプリケーションを保護するためのセキュリティ製品です。"
    },
    {
      "id": 260,
      "term": "RASP (Runtime Application Self-Protection)",
      "description": "アプリケーションが実行中に自らを保護するためのセキュリティ技術です。"
    },
    {
      "id": 261,
      "term": "IDS (Intrusion Detection System)",
      "description": "ネットワークやコンピュータシステムへの不正アクセスや攻撃を監視し、検知するためのシステムです。"
    },
    {
      "id": 262,
      "term": "IPS (Intrusion Prevention System)",
      "description": "ネットワーク上で不正アクセスや攻撃を検知し、それを阻止するためのシステムです。"
    },
    {
      "id": 263,
      "term": "UTM (Unified Threat Management)",
      "description": "ネットワークのセキュリティを一元管理するためのシステムです。"
    },
    {
      "id": 264,
      "term": "SSL/TLSアクセラレーター",
      "description": "データの暗号化と復号化を専門に行うハードウェアやソフトウェアの装置です。"
    },
    {
      "id": 265,
      "term": "MDM (Mobile Device Management)",
      "description": "企業や組織が従業員のモバイルデバイスを一元的に管理するためのシステムです。"
    },
    {
      "id": 266,
      "term": "CASB (Cloud Access Security Broker)",
      "description": "クラウドサービスのセキュリティを管理するためのソリューションです。"
    },
    {
      "id": 267,
      "term": "Webアイソレーション",
      "description": "悪意のあるWebサイトやコンテンツがデバイスに直接影響を与えないように、ユーザーの環境を隔離する仕組みです。"
    },
    {
      "id": 268,
      "term": "RASIS",
      "description": "情報システムやサービスの品質を評価するための重要な指標群であり、信頼性、可用性、保守性、完全性、安全性で構成されています。"
    },
    {
      "id": 269,
      "term": "RAS技術",
      "description": "遠隔からのアクセスに関する安全性を確保するための技術です。"
    },
    {
      "id": 270,
      "term": "耐震耐火設備",
      "description": "建物や施設が地震や火災に対して安全性を確保するために導入される装置やシステムのことです。"
    },
    {
      "id": 271,
      "term": "UPS (Uninterruptible Power Supply)",
      "description": "無停電電源装置のことであり、電力が故障した場合や停電時に一時的に電源を供給する役割を果たします。"
    },
    {
      "id": 272,
      "term": "多重化技術",
      "description": "複数の信号やデータを一つの通信路を使って同時に送信する方法です。"
    },
    {
      "id": 273,
      "term": "ストレージのミラーリング",
      "description": "データの冗長性を確保するための技術であり、同じデータを複数のストレージデバイスに同時に保存するプロセスを指します。"
    },
    {
      "id": 274,
      "term": "ハウジングセキュリティ",
      "description": "データセンターやサーバハウジング施設におけるセキュリティ対策を指します。"
    },
    {
      "id": 275,
      "term": "監視カメラ",
      "description": "特定の場所を見守るために設置されるカメラです。"
    },
    {
      "id": 276,
      "term": "セキュリティゲート",
      "description": "施設や建物の出入口に設置される防犯装置です。"
    },
    {
      "id": 277,
      "term": "アンチパスバック",
      "description": "特定の場所への入退室を制御するための仕組みであり、ユーザーが一度通過したエリアには再度入ることができないように設計されています。"
    },
    {
      "id": 278,
      "term": "インターロック",
      "description": "複数のシステムや装置が相互に作用し合うことで、特定の操作を防止または制限する仕組みです。"
    },
    {
      "id": 279,
      "term": "施錠管理",
      "description": "物理的またはデジタルな空間においてアクセスを制御するための手法やシステムのことです。"
    },
    {
      "id": 280,
      "term": "入退室管理",
      "description": "特定の場所への立ち入りや退出を監視し、制御するためのシステムです。"
    },
    {
      "id": 281,
      "term": "機械警備",
      "description": "設置されたセキュリティ機器によって自動的に侵入や異常を監視し、迅速に対応するサービスです。"
    },
    {
      "id": 282,
      "term": "クリアデスク",
      "description": "作業が終わった後にデスク上を整理し、不要なものを排除する手法です。"
    },
    {
      "id": 283,
      "term": "クリアスクリーン",
      "description": "使用しないコンピュータや端末の画面をロックすることを指します。"
    },
    {
      "id": 284,
      "term": "遠隔バックアップ",
      "description": "ネットワークを介して自宅やオフィスのデータを遠く離れたサーバやクラウドサービスに自動的にコピーする手法です。"
    },
    {
      "id": 285,
      "term": "USBキー",
      "description": "物理的にコンピュータのUSBポートに接続することで認証を行うシステムです。"
    },
    {
      "id": 286,
      "term": "セキュリティケーブル",
      "description": "主にコンピュータや周辺機器を盗難から防ぐための製品です。"
    },
    {
      "id": 287,
      "term": "IPsec",
      "description": "インターネット上でデータを暗号化し、通信の安全性を確保するプロトコルの集合です。パケットレベルでデータの盗聴や改ざんを防ぎ、VPNなどで利用されます。"
    },
    {
      "id": 288,
      "term": "SSL/TLS",
      "description": "インターネット上でのデータ通信を暗号化し、安全に行うためのプロトコルです。Webサイトとブラウザ間の通信を保護し、HTTPSで一般的に利用されています。"
    },
    {
      "id": 289,
      "term": "SSH (Secure Shell)",
      "description": "ネットワークを通じてリモートコンピュータへ安全に接続し、管理を行うためのプロトコルです。通信を暗号化することで、第三者によるデータの盗聴を防ぎます。"
    },
    {
      "id": 290,
      "term": "HTTPS",
      "description": "Webの通信プロトコルであるHTTPに、暗号化技術のTLSを組み合わせたものです。オンラインバンキングやショッピングサイトなどで、個人情報を安全に送受信するために使用されます。"
    },
    {
      "id": 291,
      "term": "QUIC",
      "description": "Googleによって開発された、高速で安全なWeb通信を実現するためのプロトコルです。UDPをベースにしており、接続の遅延を大幅に減少させることができます。"
    },
    {
      "id": 292,
      "term": "WPA2",
      "description": "無線LAN（Wi-Fi）のセキュリティプロトコルの一つで、AESという強力な暗号化方式を使用しています。外部からの不正アクセスやデータの盗聴を防ぐために広く利用されています。"
    },
    {
      "id": 293,
      "term": "WPA3",
      "description": "WPA2の後継となる無線LANのセキュリティプロトコルです。暗号化がさらに強化され、公共Wi-Fiなどでの安全性が向上しています。"
    },
    {
      "id": 294,
      "term": "Enhanced Open",
      "description": "パスワードなしで接続できるオープンなWi-Fiネットワークにおいて、通信を自動的に暗号化する技術です。公共のWi-Fi環境での盗聴リスクを低減させます。"
    },
    {
      "id": 295,
      "term": "ベイジアンフィルタリング",
      "description": "確率論に基づき、データの中から特定のパターンを識別する手法です。特にスパムメールの判定などで、受信したメッセージが迷惑メールかどうかを判断するために広く使われています。"
    },
    {
      "id": 296,
      "term": "SPF (Sender Policy Framework)",
      "description": "電子メールの送信元ドメインが正当なものかを検証する認証技術です。DNSレコードに正当なメールサーバを定義することで、なりすましメールを防止します。"
    },
    {
      "id": 297,
      "term": "DKIM (DomainKeys Identified Mail)",
      "description": "電子メールにデジタル署名を付与し、送信元の正当性と内容の改ざんがないことを証明する認証技術です。フィッシング詐欺などのリスクを減少させます。"
    },
    {
      "id": 298,
      "term": "DMARC",
      "description": "SPFとDKIMを利用してメールの送信者を認証し、なりすましやフィッシングを防ぐ技術です。認証に失敗したメールの取り扱いポリシーを送信側が指定できます。"
    },
    {
      "id": 299,
      "term": "SMTP-AUTH",
      "description": "メールを送信する際に、ユーザー名とパスワードで送信者を認証する仕組みです。正当なユーザーのみがメールサーバを利用できるようにし、不正利用を防ぎます。"
    },
    {
      "id": 300,
      "term": "OP25B (Outbound Port 25 Blocking)",
      "description": "スパムメールの送信を防ぐため、プロバイダーが外部ネットワークへのメール送信（SMTP）に使われるPort 25をブロックする対策です。"
    },
    {
      "id": 301,
      "term": "PGP (Pretty Good Privacy)",
      "description": "電子メールやファイルを暗号化し、安全に保護するための技術です。公開鍵暗号方式を採用しており、第三者による情報の盗聴を防ぎます。"
    },
    {
      "id": 302,
      "term": "S/MIME",
      "description": "電子メールの内容を暗号化し、デジタル署名を付与することでセキュリティを強化する技術です。送信者のなりすましやメールの改ざんを防ぎます。"
    },
    {
      "id": 303,
      "term": "OAuth",
      "description": "ユーザーがパスワードを直接渡すことなく、他のアプリケーションに特定のリソースへのアクセス権限を与えるための仕組みです。安全なAPI連携を実現します。"
    },
    {
      "id": 304,
      "term": "DNSSEC",
      "description": "DNSの応答にデジタル署名を付与し、その情報が正当なものであることを保証する技術です。DNSキャッシュポイズニングなどの攻撃を防ぎます。"
    },
    {
      "id": 305,
      "term": "IEEE802.1X",
      "description": "有線LANや無線LANにおいて、ネットワークに接続するデバイスを認証するための規格です。認証が成功するまで通信を許可せず、不正なデバイスの接続を防ぎます。"
    },
    {
      "id": 306,
      "term": "EAP (Extensible Authentication Protocol)",
      "description": "ネットワーク接続時にユーザー認証を行うためのフレームワークです。パスワードや証明書など、様々な認証方式を柔軟に利用することができます。"
    },
    {
      "id": 307,
      "term": "EAP-TLS",
      "description": "EAPの一種で、クライアントとサーバ双方がデジタル証明書を用いて相互に認証を行う方式です。非常に高いセキュリティレベルを提供します。"
    },
    {
      "id": 308,
      "term": "PEAP (Protected Extensible Authentication Protocol)",
      "description": "EAPの一種で、サーバー証明書で暗号化されたトンネルを構築し、その中でパスワードなどの認証情報を安全に送受信する方式です。"
    },
    {
      "id": 309,
      "term": "RADIUS",
      "description": "ネットワークに接続しようとするユーザーの認証・認可・アカウンティングを一元管理するプロトコルです。主にISPや企業内ネットワークで利用されます。"
    },
    {
      "id": 310,
      "term": "Diameter",
      "description": "RADIUSの後継プロトコルで、認証・認可・アカウンティング（AAA）機能を提供します。信頼性や拡張性が向上しており、特にモバイル通信網で利用されます。"
    },
    {
      "id": 311,
      "term": "MAC (Mandatory Access Control)",
      "description": "強制アクセス制御の略で、システム管理者が定めたポリシーに基づき、アクセス権限を厳格に管理するセキュリティモデルです。"
    },
    {
      "id": 312,
      "term": "トラステッドOS",
      "description": "アクセス制御や監査機能など、高度なセキュリティ機能を組み込んだOSです。政府機関など、機密性の高い情報を扱うシステムで利用されます。"
    },
    {
      "id": 313,
      "term": "パケットフィルタリング",
      "description": "ネットワークを流れるデータパケットのヘッダ情報（IPアドレスやポート番号）を基に、通信を許可または拒否するファイアウォールの基本機能です。"
    },
    {
      "id": 314,
      "term": "ステートフルパケットフィルタリング",
      "description": "従来のパケットフィルタリングに加え、通信のセッション状態（コンテキスト）も監視する方式です。より高度なアクセス制御を可能にします。"
    },
    {
      "id": 315,
      "term": "MACアドレスフィルタリング",
      "description": "ネットワーク機器固有のMACアドレスを基に、ネットワークへの接続を許可または拒否するセキュリティ手法です。許可した特定のデバイスのみ接続を許可します。"
    },
    {
      "id": 316,
      "term": "アプリケーションゲートウェイ方式",
      "description": "通信をアプリケーションレベルで中継・監視するファイアウォール（プロキシ）の方式です。データの内容まで検査するため、より詳細なアクセス制御が可能です。"
    },
    {
      "id": 317,
      "term": "認証サーバ",
      "description": "ネットワークやシステムへのアクセスを要求するユーザーやデバイスの身元を確認（認証）し、正当性を検証するためのサーバです。"
    },
    {
      "id": 318,
      "term": "NAT (Network Address Translation)",
      "description": "一つのグローバルIPアドレスを、複数のプライベートIPアドレスに変換する技術です。IPアドレスを節約し、内部ネットワークを外部から隠す効果があります。"
    },
    {
      "id": 319,
      "term": "NAPT (Network Address Port Translation)",
      "description": "NATの機能に加え、ポート番号も変換することで、一つのグローバルIPアドレスで複数のデバイスが同時に通信できるようにする技術です。"
    },
    {
      "id": 320,
      "term": "認証VLAN",
      "description": "デバイスがネットワークに接続した際、まず認証用のVLANに接続させ、認証が成功した後に正規のVLANへ所属させる仕組みです。"
    },
    {
      "id": 321,
      "term": "VPN (Virtual Private Network)",
      "description": "公共のインターネット上に暗号化された仮想的な専用線を構築し、安全な通信を実現する技術です。リモートアクセスや拠点間通信に利用されます。"
    },
    {
      "id": 322,
      "term": "ハニーポット",
      "description": "攻撃者をおびき寄せるための「おとり」のシステムです。攻撃者の手法や目的を調査し、セキュリティ対策を強化するために設置されます。"
    },
    {
      "id": 323,
      "term": "リバースプロキシ",
      "description": "外部からのリクエストを一旦受け取り、内部の適切なサーバに転送するサーバです。負荷分散やセキュリティ強化の目的でWebサーバの前に設置されます。"
    },
    {
      "id": 324,
      "term": "データベース暗号化",
      "description": "データベース内に保存されている個人情報などの機密データを暗号化する技術です。不正アクセスや情報漏洩時のリスクを低減します。"
    },
    {
      "id": 325,
      "term": "データベースアクセス制御",
      "description": "ユーザーの役割や権限に応じて、データベース内のどのデータにアクセスできるかを制限する仕組みです。データの機密性や整合性を保護します。"
    },
    {
      "id": 326,
      "term": "データベースバックアップ",
      "description": "データベースのデータをコピーして別の場所に保管することです。システム障害やデータ破損時に、元の状態に復旧するために不可欠です。"
    },
    {
      "id": 327,
      "term": "ログの取得",
      "description": "システムやアプリケーションの動作履歴（ログ）を記録・収集することです。障害発生時の原因調査や、不正アクセスの追跡に利用されます。"
    },
    {
      "id": 328,
      "term": "セキュアプログラミング",
      "description": "ソフトウェアの設計・開発段階からセキュリティ上の脆弱性を生まないように考慮してプログラミングを行うことです。"
    },
    {
      "id": 329,
      "term": "脆弱性検査技術",
      "description": "ソフトウェアやシステムに存在するセキュリティ上の欠陥（脆弱性）を特定・検出するための技術です。静的検査や動的検査などの手法があります。"
    },
    {
      "id": 330,
      "term": "コンテナセキュリティ",
      "description": "Dockerなどのコンテナ技術を利用した環境において、コンテナイメージや実行中のコンテナ、およびその実行環境を保護するための対策です。"
    },
    {
      "id": 331,
      "term": "Same Origin Policy",
      "description": "Webブラウザのセキュリティ機能で、異なる生成元（オリジン）のリソースへのアクセスを原則として禁止するポリシーです。"
    },
    {
      "id": 332,
      "term": "CORS (Cross-Origin Resource Sharing)",
      "description": "Same Origin Policyの制約を緩和し、異なるオリジン間でのリソース共有を安全に許可するための仕組みです。"
    },
    {
      "id": 333,
      "term": "ソルト",
      "description": "パスワードをハッシュ化する際に付与するランダムなデータです。同じパスワードでも異なるハッシュ値が生成され、セキュリティが向上します。"
    },
    {
      "id": 334,
      "term": "ペッパー",
      "description": "パスワードをハッシュ化する際に使用される、ソルトとは別の秘密の値です。データベースとは別の場所に保管され、漏洩時のリスクをさらに低減します。"
    },
    {
      "id": 335,
      "term": "ストレッチング",
      "description": "パスワードのハッシュ化処理を何千回も繰り返し実行することです。パスワード解析に必要な計算時間を増大させ、セキュリティを強化します。"
    },
    {
      "id": 336,
      "term": "バッファオーバーフロー対策",
      "description": "プログラムが確保したメモリ領域を超えるデータが入力されることで生じる脆弱性を防ぐ対策です。入力値の長さチェックなどが基本的な対策となります。"
    },
    {
      "id": 337,
      "term": "クロスサイトスクリプティング対策",
      "description": "Webサイトに悪意のあるスクリプトが埋め込まれる脆弱性を防ぐ対策です。入力値のエスケープ処理などが有効です。"
    },
    {
      "id": 338,
      "term": "SQLインジェクション対策",
      "description": "不正なSQL文を注入されてデータベースを不正操作される脆弱性を防ぐ対策です。プレースホルダの使用（バインド機構）が最も重要な対策です。"
    },
    {
      "id": 339,
      "term": "HSTS (HTTP Strict Transport Security)",
      "description": "Webサイトへの接続を常にHTTPSに強制するようブラウザに指示するセキュリティ機能です。中間者攻撃のリスクを低減します。"
    }
  ]
}